# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
# CFG file for YOLOv12-turbo

# Parameters
nc: 80 # number of classes

# YOLO12-turbo backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, CSWinTransformer,  []] # 0-P1/2
  - [-1, 1, Stage,  [0]] # 1-P2/4
  - [-1, 1, Stage,  [1]] # 2-P3/8
  - [-1, 1, Stage,  [2]] # 3-P4/16
  - [-1, 1, Stage,  [3]] # 4-P5/32
  

# YOLO12-turbo head
head:
  - [4, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[5, 3], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 7

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 10

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 7], 1, Concat, [1]] # cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 13

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 4], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 16 (P5/32-large)

  - [[10, 13, 16], 1, Detect, [nc]] # Detect(P3, P4, P5)
