# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
# CFG file for YOLOv12-turbo

# Parameters
nc: 80 # number of classes

# YOLO12-turbo backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, CSWinStem, [3, 64]] # 0
  - [-1, 1, CSWinStage, [64, 1, 2]] # 1

  - [-1, 1, CSWDownsample, [64, 128]] # 2
  - [-1, 1, CSWinStage, [128, 2, 4]] # 3

  - [-1, 1, CSWDownsample, [128, 256]] # 4
  - [-1, 1, CSWinStage, [256, 21, 8]] # 5

  - [-1, 1, CSWDownsample, [256, 512]] # 6
  - [-1, 1, CSWinStage, [512, 1, 16]] # 7

# YOLO12-turbo head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 10

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 13

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 16

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 7], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 19 (P5/32-large)

  - [[13, 16, 19], 1, Detect, [nc]] # Detect(P3, P4, P5)

